#Задача 5
n =intinput('Введите число n '))
print (n + n**2 + n**3 + n**4 + n**5)
